const TimeTable = [
	{
		name: "Понедельник",
		lessons: [
			"",
			["ЦиМПУ", "155"],
			["НСТК", "102"],
			["ФиЗ", ""],
			{
				odd: ["", ""],
				even: ["М и И", "109"]
			},
		],
	},
	{
		name: "Вторник",
		lessons: [
			"",
			["Охрана труда", "205"],
			["ТУиДС", "207"],
			["ЦиМПУ", "155"],
			["ООП", "325"],
		]
	},	{
		name: "Среда",
		lessons: [
			{
				odd: ["ЦиМПУ", "155"],
				even: ["ОПСиСТ", "123"]
			},
			["Инженерная графика", "<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>"],
			["Охрана труда", "201"],
			["ФиЗ", ""],
		]
	},	{
		name: "Четверг",
		lessons: [
			"",
			["ЦиМПУ", "155"],
			["ТУиДС", "204"],
			["ТЭС", "208"],
			["МиИ", "109"],
		]
	},	{
		name: "Пятница",
		lessons: [
			"",
			["ООП", "325"],
			["НСТК", "102"],
			["ФиЗ", ""],
			{
				odd: ["ООП", "325"],
				even: ["", ""]
			},
		]
	},	{
		name: "Суббота",
		lessons: [
			["ОПСиСТ", "123"],
			["МиИ", "109"],
		]
	},
];
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				odd: ["Название 1,3", "кабинет"],
				even: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (8 * 60),
			end: (8 * 60) + 45,
		},
		{
			start: (8 * 60) + 55,
			end: (9 * 60) + 40
		}
	],
	//вторая
	[
		{
			start: (9 * 60) + 55,
			end: (10 * 60) + 40,
		},
		{
			start: (10 * 60) + 50,
			end: (11 * 60) + 35
		}
	],
	//третья
	[
		{
			start: (12 * 60) + 15,
			end: (13 * 60),
		},
		{
			start: (13 * 60) + 10,
			end: (13 * 60) + 55
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 10,
			end: (14 * 60) + 55,
		},
		{
			start: (15 * 60) + 5,
			end: (15 * 60) + 50
		}
	],
	//пятая
	[
		{
			start: (16 * 60) + 20,
			end: (17 * 60) + 5,
		},
		{
			start: (17 * 60) + 15,
			end: (18 * 60)
		}
	],

];

/*
(часы * 60) + минуты

 */