//<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>

const TimeTable = [
	{
		name: "Понедельник",
		lessons: [
			"",
			["ЦиМПУ", ""],
			["ИГ", ""],
			["Иг", ""],
			["МСП", ""],
		],
	},
	{
		name: "Вторник",
		lessons: [
			"",
			"",
			["ЦиМПу", ""],
			["ФиЗ", ""],
			["ОПСиСТ", ""],
			["ИСП", ""],
		]
	},	{
		name: "Среда",
		lessons: [
			{
				odd: ["", ""],
				even: ["ОПСиСТ", "123"]
			},
			["КССТ", ""],
			["ТУиДС Т", ""],
			["МСП", ""],
		]
	},	{
		name: "Четверг",
		lessons: [
			["ЦиМПУ", ""],
			["ТУиДС", ""],
			["ФиЗ", ""],
			["КССТ", ""],
		]
	},	{
		name: "Пятница",
		lessons: [
			["Военная кафедра", ""],
		]
	},	{
		name: "Суббота",
		lessons: [
			"",
			["МСП", ""],
			["КССТ", ""],
			["ФиЗ", ""],
		]
	},
];
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				odd: ["Название 1,3", "кабинет"],
				even: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (8 * 60),
			end: (8 * 60) + 45,
		},
		{
			start: (8 * 60) + 55,
			end: (9 * 60) + 40
		}
	],
	//вторая
	[
		{
			start: (9 * 60) + 55,
			end: (10 * 60) + 40,
		},
		{
			start: (10 * 60) + 50,
			end: (11 * 60) + 35
		}
	],
	//третья
	[
		{
			start: (12 * 60) + 15,
			end: (13 * 60),
		},
		{
			start: (13 * 60) + 10,
			end: (13 * 60) + 55
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 10,
			end: (14 * 60) + 55,
		},
		{
			start: (15 * 60) + 5,
			end: (15 * 60) + 50
		}
	],
	//пятая
	[
		{
			start: (16 * 60) + 20,
			end: (17 * 60) + 5,
		},
		{
			start: (17 * 60) + 15,
			end: (18 * 60)
		}
	],

];

/*
(часы * 60) + минуты

 */