//<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>
const TimeTable = [
	{
		name: "Понедельник",
		lessons: [
			"",
			"",
			"",
			["ПОММС", 325],
			["Экономика организации", 307],
			["Основы менеджмента", 325]
		],
	},
	{
		name: "Вторник",
		lessons: [
			"",
			"",
			{
				odd: ["ИСиБД", 325],
				even: ["ПОММС", 325]
			},
			["ООСиЭС", 309],
			{
				odd: ["ФиЗ", "с/з"],
				even: ["ООСиЭС", 309]
			},
			["Ин. яз.", "<p class=\"twocabs\">213</p><p class=\"twocabs\">215</p>"]
		]
	},	{
		name: "Среда",
		lessons: [
			"",
			"",
			{
				odd: ["Основы менеджмента", 314],
				even: ["", ""]
			},
			["Ин. яз.", "<p class=\"twocabs\">213</p><p class=\"twocabs\">205</p>"],
			["КП и ЯП", 323],
			["Экономика организации", 307]
		]
	},	{
		name: "Четверг",
		lessons: [
			"",
			["ИСиБД", 325],
			["ИСиБД", 325],
			["ПОММС", 325],
			["ФиЗ", "с/з"]
		]
	},	{
		name: "Пятница",
		lessons: [
			["Военная кафедра", ""],
		]
	},	{
		name: "Суббота",
		lessons: [
			"",
			"",
			["ИСиБД", 325],
			["Ин. яз.", "<p class=\"twocabs\">213</p><p class=\"twocabs\">215</p>"]
		]
	},
];
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				odd: ["Название 1,3", "кабинет"],
				even: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (8 * 60),
			end: (8 * 60) + 45,
		},
		{
			start: (8 * 60) + 55,
			end: (9 * 60) + 40
		}
	],
	//вторая
	[
		{
			start: (9 * 60) + 55,
			end: (10 * 60) + 40,
		},
		{
			start: (10 * 60) + 50,
			end: (11 * 60) + 35
		}
	],
	//третья
	[
		{
			start: (12 * 60) + 15,
			end: (13 * 60),
		},
		{
			start: (13 * 60) + 10,
			end: (13 * 60) + 55
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 10,
			end: (14 * 60) + 55,
		},
		{
			start: (15 * 60) + 5,
			end: (15 * 60) + 50
		}
	],
	//пятая
	[
		{
			start: (16 * 60) + 20,
			end: (17 * 60) + 5,
		},
		{
			start: (17 * 60) + 15,
			end: (18 * 60)
		}
	],
	//шестая
	[
		{
			start: (18 * 60) + 15,
			end: (19 * 60),
		},
		{
			start: (19 * 60) + 10,
			end: (19 * 60) + 55
		}
	],
	//седьмая
	[
		{
			start: (20 * 60) + 10,
			end: (20 * 60) + 55,
		},
		{
			start: (21 * 60) + 05,
			end: (21 * 60) + 55
		}
	],

];

/*
(часы * 60) + минуты

 */