//<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>
const TimeTable = [{
	"lessons": [
		["", ""],
		["ТА", "5 каб"],
		["ТА", "5 каб"],
		["ПОССиЯМ", "8 каб"],
		["СПО", "9-10 каб"]
	],
	"name": "Понедельник (<a href='https://yandex.by/maps/-/CKQVIW8f' target='_blank'>Семёнова 14</a>)"
}, {
	"lessons": [
		["", ""],
		["", ""],
		["ЭПОСТ", "204"],
		["ОТЭСТк", "123"],
		["ФиЗ", "с/з"],
		["Бел. Яз.", "305"]
	],
	"name": "Вторник"
}, {
	"lessons": [
		["", ""],
		["", ""], {
			"even": ["ЭПОСТ", "204"],
			"odd": ["", ""]
		}, {
			"even": ["Экономика", "325"],
			"odd": ["ЭПОСТ", "204"]
		},
		["Экономика", "325"]
	],
	"name": "Среда"
}, {
	"lessons": [
		["", ""],
		["", ""],
		["СДиТКиКС", "317"],
		["КПиЯП", "323"],
		["КПиЯП", "323"],
		["ПОССиЯМ", "323"]
	],
	"name": "Четверг"
}, {
	"lessons": [
		["Военная кафедра", ""],
		["Военная кафедра", ""],
		["Военная кафедра", ""],
		["Военная кафедра", ""]
	],
	"name": "Пятница"
}, {
	"lessons": [
		["", ""],
		["", ""], {
			"even": ["Экономика", "302"],
			"odd": ["ФиЗ", "c/з"]
		}, {
			"even": ["СПО", "320"],
			"odd": ["ОТЭСТк", "219"]
		}
	],
	"name": "Суббота"
}]
;
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				odd: ["Название 1,3", "кабинет"],
				even: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (8 * 60),
			end: (8 * 60) + 45,
		},
		{
			start: (8 * 60) + 55,
			end: (9 * 60) + 40
		}
	],
	//вторая
	[
		{
			start: (9 * 60) + 55,
			end: (10 * 60) + 40,
		},
		{
			start: (10 * 60) + 50,
			end: (11 * 60) + 35
		}
	],
	//третья
	[
		{
			start: (12 * 60) + 15,
			end: (13 * 60),
		},
		{
			start: (13 * 60) + 10,
			end: (13 * 60) + 55
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 10,
			end: (14 * 60) + 55,
		},
		{
			start: (15 * 60) + 5,
			end: (15 * 60) + 50
		}
	],
	//пятая
	[
		{
			start: (16 * 60) + 20,
			end: (17 * 60) + 5,
		},
		{
			start: (17 * 60) + 15,
			end: (18 * 60)
		}
	],
	//шестая
	[
		{
			start: (18 * 60) + 15,
			end: (19 * 60),
		},
		{
			start: (19 * 60) + 10,
			end: (19 * 60) + 55
		}
	],
	//седьмая
	[
		{
			start: (20 * 60) + 10,
			end: (20 * 60) + 55,
		},
		{
			start: (21 * 60) + 05,
			end: (21 * 60) + 55
		}
	],

];

/*
(часы * 60) + минуты

 */