//<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>
const TimeTable = [{
	"lessons": [
		{
			"odd": ["Мат. ан. Келдыш", "517"],
			"even": ["", ""]
		},
		["Информат. Филипович", "500"],
		["Информат. Филипович", "500"],
		["17:30 Физвосп", ""]
	],
	"name": "Понедельник"
}, {
	"lessons": [
		["<font color=\"green\">Осн. програм. Семёнов</font>", "<font color=\"green\">500</font>"],
		["Осн. програм. Семёнов", "500"],
		["Осн. програм. Семёнов", "500"],
		{
			"odd": ["ИНО", "612"],
			"even": ["ИНО", "611"]
		}
	],
	"name": "Вторник"
}, {
	"lessons": [
		{
			"odd": ["", ""],
			"even": ["Осн. програм. Кротов", "500"]
		},
		["<s>Осн. програм. Семёнов</s>", "<s>500</s>"]
	],
	"name": "Среда"
}, {
	"lessons": [
		["Матем. анал. Келдыш", "600"],
		["Матем. анал. Келдыш", "513"],
		["Начерт. геом.", "612"],
		["Анал. геом. Бирюков", "513"]
	],
	"name": "Четверг"
}, {
	"lessons": [
		["Социология Сафонов", "513"],
		["Аналит. геом. Беднов", "600"],
		{
			"odd": ["Социолог Сафонова", "600"],
			"even": ["Начерт. геом.", "600"]
		}
	],
	"name": "Пятница"
}, {
	"lessons": [
		["8:15 Физвосп", ""]
	],
	"name": "Суббота"
}]
;
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				even: ["Название 1,3", "кабинет"],
				odd: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (9 * 60),
			end: (9 * 60) + 45,
		},
		{
			start: (9 * 60) + 50,
			end: (10 * 60) + 35,
		}
	],
	//вторая
	[
		{
			start: (10 * 60) + 45,
			end: (11 * 60) + 30,
		},
		{
			start: (11 * 60) + 35,
			end: (12 * 60) + 20,
		}
	],
	//третья
	[
		{
			start: (13 * 60) + 5,
			end: (13 * 60) + 50,
		},
		{
			start: (13 * 60) + 55,
			end: (14 * 60) + 40,
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 50,
			end: (15 * 60) + 35,
		},
		{
			start: (15 * 60) + 40,
			end: (16 * 60) + 25
		}
	]
];

/*
(часы * 60) + минуты

 */