//<p class=\"twocabs\">317</p><p class=\"twocabs\">319</p>
const TimeTable = [{
	"lessons": [
		{
			"odd": ["История", "л"],
			"even": ["Програм. Кротов", "500"]
		},
		["Програм. Кротов", "500"],
		["История", "611"],
		["ИНО", "610\n611"]
	],
	"name": "Понедельник"
}, {
	"lessons": [
		["Физика", "600"],
		["Интегралы и диф", "600"],
		{
			"odd": ["Програм. Семенов", "500"],
			"even": ["", ""]
		},
		{
			"odd": ["Физика", "612"],
			"even": ["Програм. Семенов", "500"],
		},
	],
	"name": "Вторник"
}, {
	"lessons": [
		["Физика (лаб)", ""],
		{
			"odd": ["", ""],
			"even": ["Физра", ""]
		},
	],
	"name": "Среда"
}, {
	"lessons": [
		["", ""],
		["Интегралы и диф", "513"],
		{
			"odd": ["Инжграф Эрастова", "513"],
			"even": ["Инжграф Корягина", "500"],
		},
		{
			"odd": ["Интегралы и диф", "513"],
			"even": ["", ""],
		},
	],
	"name": "Четверг"
}, {
	"lessons": [
		{
			"odd": ["", ""],
			"even": ["Архит авт сис", "506"],
		},
		["Архит авт сис", "506"],
		["Линейная алгебра", "600"],
		["Линейная алгебра", "600"],
	],
	"name": "Пятница"
}, {
	"lessons": [
		["zoom Физра", ""]
	],
	"name": "Суббота"
}]
;

TimeTable[2].lessons[0].time = "13:50\n15:25";
TimeTable[2].lessons[1].time = "17:30";
TimeTable[3].lessons[0].time = "08:30\n10:05";
TimeTable[3].lessons[1].time = "10:45\n12:20";
TimeTable[3].lessons[2].time = "13:05\n14:40";
TimeTable[3].lessons[3].time = "14:50\n16:25";
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				even: ["Название 1,3", "кабинет"],
				odd: ["название 2,4", "кабинет"]
			},


*/


const lessonTime = [
	//первая пара
	[
		{
			start: (9 * 60),
			end: (9 * 60) + 45,
		},
		{
			start: (9 * 60) + 50,
			end: (10 * 60) + 35,
		}
	],
	//вторая
	[
		{
			start: (10 * 60) + 45,
			end: (11 * 60) + 30,
		},
		{
			start: (11 * 60) + 35,
			end: (12 * 60) + 20,
		}
	],
	//третья
	[
		{
			start: (13 * 60) + 5,
			end: (13 * 60) + 50,
		},
		{
			start: (13 * 60) + 55,
			end: (14 * 60) + 40,
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 50,
			end: (15 * 60) + 35,
		},
		{
			start: (15 * 60) + 40,
			end: (16 * 60) + 25
		}
	]
];

/*
(часы * 60) + минуты

 */