const TimeTable = [
	{
		name: "Понедельник",
		lessons: [
			"",
			["Ц и МПУ", "155"],
			["НСТК", "102"],
			["ФиЗ", "1ч"],
			{
				odd: ["", ""],
				even: ["М и И", "109"]
			},
		],
	},
	{
		name: "Вторник",
		lessons: [
			"",
			["Охрана труда", "205"],
			["ТУ и ДС", "207"],
			["Ц и МПУ", "155"],
			["ООП", "325"],
		]
	},	{
		name: "Среда",
		lessons: [
			["Инженерная графика", ""],
			{
				odd: ["Ц и МПУ", ""],
				even: ["ООП", ""]
			},
			["Охрана труда", ""],
			["ФиЗ", ""],
		]
	},	{
		name: "Четверг",
		lessons: [
			"",
			["Ц и МПУ", ""],
			["ТУ и ДС", ""],
			["ТЭС", ""],
			["М и И", ""],
		]
	},	{
		name: "Пятница",
		lessons: [
			"",
			["ООП", ""],
			{
				odd: ["ОПС и СТ", ""],
				even: ["ТЭС", ""]
			},
			["ФиЗ", ""],
			["НСТК", ""],
		]
	},	{
		name: "Суббота",
		lessons: [
			"",
			["М и И", "109"],
			["ОПС и СТ", "123"],
		]
	},
];
//конец расписания
/*
пустая пара добавляется с помошью ""
обычная пара добавляется:
			["название", "кабинет"],
пара с зависимостью от чётности недели добавляется с помощью:
			{
				odd: ["Название 1,3", "кабинет"],
				even: ["название 2,4", "кабинет"]
			},


 */


const lessonTime = [
	//первая пара
	[
		{
			start: (8 * 60),
			end: (8 * 60) + 45,
		},
		{
			start: (8 * 60) + 55,
			end: (9 * 60) + 40
		}
	],
	//вторая
	[
		{
			start: (9 * 60) + 55,
			end: (10 * 60) + 40,
		},
		{
			start: (10 * 60) + 50,
			end: (11 * 60) + 35
		}
	],
	//третья
	[
		{
			start: (12 * 60) + 15,
			end: (13 * 60),
		},
		{
			start: (13 * 60) + 10,
			end: (13 * 60) + 55
		}
	],
	//четвертая
	[
		{
			start: (14 * 60) + 10,
			end: (14 * 60) + 55,
		},
		{
			start: (15 * 60) + 5,
			end: (15 * 60) + 50
		}
	],
	//пятая
	[
		{
			start: (16 * 60) + 20,
			end: (17 * 60) + 5,
		},
		{
			start: (17 * 60) + 15,
			end: (18 * 60)
		}
	],

];

/*
(часы * 60) + минуты

 */